benchmarking/config-comparison-results/go-db-no-saves-results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: stress-test-optimized.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 2m15s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 1m45s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2025-09-13T14:53:36+01:00" level=info msg="Setting up optimized stress test..." source=console
time="2025-09-13T14:53:36+01:00" level=info msg="Note: This test assumes go-db is configured with -transaction-save=false" source=console
time="2025-09-13T14:53:37+01:00" level=info msg="Optimized stress test setup complete" source=console

running (0m01.0s), 002/100 VUs, 3 complete and 0 interrupted iterations
default   [   1% ] 002/100 VUs  0m00.8s/1m45.0s

running (0m02.0s), 003/100 VUs, 14 complete and 0 interrupted iterations
default   [   2% ] 003/100 VUs  0m01.8s/1m45.0s

running (0m03.0s), 004/100 VUs, 28 complete and 0 interrupted iterations
default   [   3% ] 004/100 VUs  0m02.8s/1m45.0s

running (0m04.0s), 005/100 VUs, 51 complete and 0 interrupted iterations
default   [   4% ] 005/100 VUs  0m03.8s/1m45.0s

running (0m05.0s), 007/100 VUs, 76 complete and 0 interrupted iterations
default   [   5% ] 007/100 VUs  0m04.8s/1m45.0s

running (0m06.0s), 008/100 VUs, 95 complete and 0 interrupted iterations
default   [   6% ] 008/100 VUs  0m05.8s/1m45.0s

running (0m07.0s), 009/100 VUs, 120 complete and 0 interrupted iterations
default   [   6% ] 009/100 VUs  0m06.8s/1m45.0s

running (0m08.0s), 010/100 VUs, 146 complete and 0 interrupted iterations
default   [   7% ] 010/100 VUs  0m07.8s/1m45.0s

running (0m09.0s), 012/100 VUs, 178 complete and 0 interrupted iterations
default   [   8% ] 012/100 VUs  0m08.8s/1m45.0s

running (0m10.0s), 013/100 VUs, 203 complete and 0 interrupted iterations
default   [   9% ] 013/100 VUs  0m09.8s/1m45.0s

running (0m11.0s), 014/100 VUs, 229 complete and 0 interrupted iterations
default   [  10% ] 014/100 VUs  0m10.8s/1m45.0s

running (0m12.0s), 015/100 VUs, 255 complete and 0 interrupted iterations
default   [  11% ] 015/100 VUs  0m11.8s/1m45.0s

running (0m13.0s), 017/100 VUs, 289 complete and 0 interrupted iterations
default   [  12% ] 017/100 VUs  0m12.8s/1m45.0s

running (0m14.0s), 018/100 VUs, 323 complete and 0 interrupted iterations
default   [  13% ] 018/100 VUs  0m13.8s/1m45.0s

running (0m15.0s), 019/100 VUs, 342 complete and 0 interrupted iterations
default   [  14% ] 019/100 VUs  0m14.8s/1m45.0s

running (0m16.0s), 021/100 VUs, 372 complete and 0 interrupted iterations
default   [  15% ] 021/100 VUs  0m15.8s/1m45.0s

running (0m17.0s), 023/100 VUs, 394 complete and 0 interrupted iterations
default   [  16% ] 023/100 VUs  0m16.8s/1m45.0s

running (0m18.0s), 025/100 VUs, 420 complete and 0 interrupted iterations
default   [  17% ] 025/100 VUs  0m17.8s/1m45.0s

running (0m19.0s), 027/100 VUs, 454 complete and 0 interrupted iterations
default   [  18% ] 027/100 VUs  0m18.8s/1m45.0s

running (0m20.0s), 029/100 VUs, 481 complete and 0 interrupted iterations
default   [  19% ] 029/100 VUs  0m19.8s/1m45.0s

running (0m21.0s), 031/100 VUs, 516 complete and 0 interrupted iterations
default   [  20% ] 031/100 VUs  0m20.8s/1m45.0s

running (0m22.0s), 033/100 VUs, 567 complete and 0 interrupted iterations
default   [  21% ] 033/100 VUs  0m21.8s/1m45.0s

running (0m23.0s), 035/100 VUs, 595 complete and 0 interrupted iterations
default   [  22% ] 035/100 VUs  0m22.8s/1m45.0s

running (0m24.0s), 037/100 VUs, 625 complete and 0 interrupted iterations
default   [  23% ] 037/100 VUs  0m23.8s/1m45.0s

running (0m25.0s), 039/100 VUs, 655 complete and 0 interrupted iterations
default   [  24% ] 039/100 VUs  0m24.8s/1m45.0s

running (0m26.0s), 041/100 VUs, 688 complete and 0 interrupted iterations
default   [  25% ] 041/100 VUs  0m25.8s/1m45.0s

running (0m27.0s), 043/100 VUs, 707 complete and 0 interrupted iterations
default   [  26% ] 043/100 VUs  0m26.8s/1m45.0s

running (0m28.0s), 045/100 VUs, 734 complete and 0 interrupted iterations
default   [  26% ] 045/100 VUs  0m27.8s/1m45.0s

running (0m29.0s), 047/100 VUs, 744 complete and 0 interrupted iterations
default   [  27% ] 047/100 VUs  0m28.8s/1m45.0s

running (0m30.0s), 049/100 VUs, 747 complete and 0 interrupted iterations
default   [  28% ] 049/100 VUs  0m29.8s/1m45.0s

running (0m31.0s), 051/100 VUs, 791 complete and 0 interrupted iterations
default   [  29% ] 051/100 VUs  0m30.8s/1m45.0s

running (0m32.0s), 052/100 VUs, 821 complete and 0 interrupted iterations
default   [  30% ] 052/100 VUs  0m31.8s/1m45.0s

running (0m33.0s), 054/100 VUs, 868 complete and 0 interrupted iterations
default   [  31% ] 054/100 VUs  0m32.8s/1m45.0s

running (0m34.0s), 056/100 VUs, 894 complete and 0 interrupted iterations
default   [  32% ] 056/100 VUs  0m33.8s/1m45.0s

running (0m35.0s), 057/100 VUs, 928 complete and 0 interrupted iterations
default   [  33% ] 057/100 VUs  0m34.8s/1m45.0s

running (0m36.0s), 059/100 VUs, 967 complete and 0 interrupted iterations
default   [  34% ] 059/100 VUs  0m35.8s/1m45.0s

running (0m37.0s), 061/100 VUs, 993 complete and 0 interrupted iterations
default   [  35% ] 061/100 VUs  0m36.8s/1m45.0s

running (0m38.0s), 062/100 VUs, 1056 complete and 0 interrupted iterations
default   [  36% ] 062/100 VUs  0m37.8s/1m45.0s

running (0m39.0s), 064/100 VUs, 1111 complete and 0 interrupted iterations
default   [  37% ] 064/100 VUs  0m38.8s/1m45.0s

running (0m40.0s), 066/100 VUs, 1137 complete and 0 interrupted iterations
default   [  38% ] 066/100 VUs  0m39.8s/1m45.0s

running (0m41.0s), 067/100 VUs, 1180 complete and 0 interrupted iterations
default   [  39% ] 067/100 VUs  0m40.8s/1m45.0s

running (0m42.0s), 069/100 VUs, 1210 complete and 0 interrupted iterations
default   [  40% ] 069/100 VUs  0m41.8s/1m45.0s

running (0m43.0s), 071/100 VUs, 1235 complete and 0 interrupted iterations
default   [  41% ] 071/100 VUs  0m42.8s/1m45.0s

running (0m44.0s), 072/100 VUs, 1263 complete and 0 interrupted iterations
default   [  42% ] 072/100 VUs  0m43.8s/1m45.0s

running (0m45.0s), 074/100 VUs, 1305 complete and 0 interrupted iterations
default   [  43% ] 074/100 VUs  0m44.8s/1m45.0s

running (0m46.0s), 076/100 VUs, 1338 complete and 0 interrupted iterations
default   [  44% ] 076/100 VUs  0m45.8s/1m45.0s

running (0m47.0s), 077/100 VUs, 1373 complete and 0 interrupted iterations
default   [  45% ] 077/100 VUs  0m46.8s/1m45.0s

running (0m48.0s), 079/100 VUs, 1399 complete and 0 interrupted iterations
default   [  46% ] 079/100 VUs  0m47.8s/1m45.0s

running (0m49.0s), 081/100 VUs, 1416 complete and 0 interrupted iterations
default   [  46% ] 081/100 VUs  0m48.8s/1m45.0s

running (0m50.0s), 082/100 VUs, 1433 complete and 0 interrupted iterations
default   [  47% ] 082/100 VUs  0m49.8s/1m45.0s

running (0m51.0s), 084/100 VUs, 1447 complete and 0 interrupted iterations
default   [  48% ] 084/100 VUs  0m50.8s/1m45.0s

running (0m52.0s), 086/100 VUs, 1483 complete and 0 interrupted iterations
default   [  49% ] 086/100 VUs  0m51.8s/1m45.0s

running (0m53.0s), 087/100 VUs, 1507 complete and 0 interrupted iterations
default   [  50% ] 087/100 VUs  0m52.8s/1m45.0s

running (0m54.0s), 089/100 VUs, 1532 complete and 0 interrupted iterations
default   [  51% ] 089/100 VUs  0m53.8s/1m45.0s

running (0m55.0s), 091/100 VUs, 1583 complete and 0 interrupted iterations
default   [  52% ] 091/100 VUs  0m54.8s/1m45.0s

running (0m56.0s), 092/100 VUs, 1609 complete and 0 interrupted iterations
default   [  53% ] 092/100 VUs  0m55.8s/1m45.0s

running (0m57.0s), 094/100 VUs, 1644 complete and 0 interrupted iterations
default   [  54% ] 094/100 VUs  0m56.8s/1m45.0s

running (0m58.0s), 096/100 VUs, 1670 complete and 0 interrupted iterations
default   [  55% ] 096/100 VUs  0m57.8s/1m45.0s

running (0m59.0s), 097/100 VUs, 1689 complete and 0 interrupted iterations
default   [  56% ] 097/100 VUs  0m58.8s/1m45.0s

running (1m00.0s), 099/100 VUs, 1720 complete and 0 interrupted iterations
default   [  57% ] 099/100 VUs  0m59.8s/1m45.0s

running (1m01.0s), 100/100 VUs, 1749 complete and 0 interrupted iterations
default   [  58% ] 100/100 VUs  1m00.8s/1m45.0s

running (1m02.0s), 100/100 VUs, 1780 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  1m01.8s/1m45.0s

running (1m03.0s), 100/100 VUs, 1805 complete and 0 interrupted iterations
default   [  60% ] 100/100 VUs  1m02.8s/1m45.0s

running (1m04.0s), 100/100 VUs, 1833 complete and 0 interrupted iterations
default   [  61% ] 100/100 VUs  1m03.8s/1m45.0s

running (1m05.0s), 100/100 VUs, 1855 complete and 0 interrupted iterations
default   [  62% ] 100/100 VUs  1m04.8s/1m45.0s

running (1m06.0s), 100/100 VUs, 1899 complete and 0 interrupted iterations
default   [  63% ] 100/100 VUs  1m05.8s/1m45.0s

running (1m07.0s), 100/100 VUs, 1928 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  1m06.8s/1m45.0s

running (1m08.0s), 100/100 VUs, 1964 complete and 0 interrupted iterations
default   [  65% ] 100/100 VUs  1m07.8s/1m45.0s

running (1m09.0s), 100/100 VUs, 1989 complete and 0 interrupted iterations
default   [  66% ] 100/100 VUs  1m08.8s/1m45.0s

running (1m10.0s), 100/100 VUs, 2004 complete and 0 interrupted iterations
default   [  66% ] 100/100 VUs  1m09.8s/1m45.0s

running (1m11.0s), 100/100 VUs, 2011 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  1m10.8s/1m45.0s

running (1m12.0s), 100/100 VUs, 2040 complete and 0 interrupted iterations
default   [  68% ] 100/100 VUs  1m11.8s/1m45.0s

running (1m13.0s), 100/100 VUs, 2058 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  1m12.8s/1m45.0s

running (1m14.0s), 100/100 VUs, 2092 complete and 0 interrupted iterations
default   [  70% ] 100/100 VUs  1m13.8s/1m45.0s

running (1m15.0s), 100/100 VUs, 2124 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  1m14.8s/1m45.0s

running (1m16.0s), 100/100 VUs, 2144 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  1m15.8s/1m45.0s

running (1m17.0s), 100/100 VUs, 2181 complete and 0 interrupted iterations
default   [  73% ] 100/100 VUs  1m16.8s/1m45.0s

running (1m18.0s), 100/100 VUs, 2210 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  1m17.8s/1m45.0s

running (1m19.0s), 100/100 VUs, 2229 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  1m18.8s/1m45.0s

running (1m20.0s), 100/100 VUs, 2239 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  1m19.8s/1m45.0s

running (1m21.0s), 100/100 VUs, 2263 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  1m20.8s/1m45.0s

running (1m22.0s), 100/100 VUs, 2292 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  1m21.8s/1m45.0s

running (1m23.0s), 100/100 VUs, 2326 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  1m22.8s/1m45.0s

running (1m24.0s), 100/100 VUs, 2354 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  1m23.8s/1m45.0s

running (1m25.0s), 100/100 VUs, 2399 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  1m24.8s/1m45.0s

running (1m26.0s), 100/100 VUs, 2430 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  1m25.8s/1m45.0s

running (1m27.0s), 100/100 VUs, 2455 complete and 0 interrupted iterations
default   [  83% ] 100/100 VUs  1m26.8s/1m45.0s

running (1m28.0s), 100/100 VUs, 2477 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  1m27.8s/1m45.0s

running (1m29.0s), 100/100 VUs, 2508 complete and 0 interrupted iterations
default   [  85% ] 100/100 VUs  1m28.8s/1m45.0s

running (1m30.0s), 100/100 VUs, 2542 complete and 0 interrupted iterations
default   [  86% ] 100/100 VUs  1m29.8s/1m45.0s

running (1m31.0s), 100/100 VUs, 2561 complete and 0 interrupted iterations
default   [  86% ] 100/100 VUs  1m30.8s/1m45.0s

running (1m32.0s), 097/100 VUs, 2585 complete and 0 interrupted iterations
default   [  87% ] 097/100 VUs  1m31.8s/1m45.0s

running (1m33.0s), 094/100 VUs, 2635 complete and 0 interrupted iterations
default   [  88% ] 094/100 VUs  1m32.8s/1m45.0s

running (1m34.0s), 094/100 VUs, 2653 complete and 0 interrupted iterations
default   [  89% ] 094/100 VUs  1m33.8s/1m45.0s

running (1m35.0s), 084/100 VUs, 2691 complete and 0 interrupted iterations
default   [  90% ] 084/100 VUs  1m34.8s/1m45.0s

running (1m36.0s), 076/100 VUs, 2723 complete and 0 interrupted iterations
default   [  91% ] 076/100 VUs  1m35.8s/1m45.0s

running (1m37.0s), 072/100 VUs, 2740 complete and 0 interrupted iterations
default   [  92% ] 072/100 VUs  1m36.8s/1m45.0s

running (1m38.0s), 068/100 VUs, 2753 complete and 0 interrupted iterations
default   [  93% ] 068/100 VUs  1m37.8s/1m45.0s

running (1m39.0s), 062/100 VUs, 2773 complete and 0 interrupted iterations
default   [  94% ] 062/100 VUs  1m38.8s/1m45.0s

running (1m40.0s), 058/100 VUs, 2794 complete and 0 interrupted iterations
default   [  95% ] 058/100 VUs  1m39.8s/1m45.0s

running (1m41.0s), 037/100 VUs, 2840 complete and 0 interrupted iterations
default   [  96% ] 037/100 VUs  1m40.8s/1m45.0s

running (1m42.0s), 031/100 VUs, 2852 complete and 0 interrupted iterations
default   [  97% ] 031/100 VUs  1m41.8s/1m45.0s

running (1m43.0s), 025/100 VUs, 2885 complete and 0 interrupted iterations
default   [  98% ] 025/100 VUs  1m42.8s/1m45.0s

running (1m44.0s), 013/100 VUs, 2916 complete and 0 interrupted iterations
default   [  99% ] 013/100 VUs  1m43.8s/1m45.0s

running (1m45.0s), 003/100 VUs, 2940 complete and 0 interrupted iterations
default   [ 100% ] 003/100 VUs  1m44.8s/1m45.0s
time="2025-09-13T14:55:22+01:00" level=info msg="Optimized stress test teardown complete" source=console


  █ THRESHOLDS 

    errors
    ✓ 'rate<0.01' rate=0.00%

    http_req_duration
    ✗ 'p(95)<500' p(95)=8.77s

    http_req_failed
    ✓ 'rate<0.01' rate=0.06%


  █ TOTAL RESULTS 

    checks_total.......: 2943    27.93359/s
    checks_succeeded...: 100.00% 2943 out of 2943
    checks_failed......: 0.00%   0 out of 2943

    ✓ stress update status is 200 or 404
    ✓ stress batch insert status is 201
    ✓ stress find status is 200
    ✓ stress get by id status is 200 or 404
    ✓ stress insert status is 201

    CUSTOM
    errors.........................: 0.00%  0 out of 0

    HTTP
    http_req_duration..............: avg=2.21s min=134µs  med=386.11ms max=12.52s p(90)=7.55s p(95)=8.77s
      { expected_response:true }...: avg=2.22s min=207µs  med=387.35ms max=12.52s p(90)=7.55s p(95)=8.77s
    http_req_failed................: 0.06%  2 out of 2946
    http_reqs......................: 2946   27.962065/s

    EXECUTION
    iteration_duration.............: avg=2.32s min=5.74ms med=499.53ms max=12.62s p(90)=7.67s p(95)=8.88s
    iterations.....................: 2943   27.93359/s
    vus............................: 3      min=2         max=100
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 3.8 MB 36 kB/s
    data_sent......................: 1.1 MB 10 kB/s



running (1m45.4s), 000/100 VUs, 2943 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  1m45s
time="2025-09-13T14:55:22+01:00" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"